УТ_для_edt/src/Documents/смартКорректировкаГТДНеДляПродажи/смартКорректировкаГТДНеДляПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартКорректировкаГТДНеДляПродажи</name>
  <comment>//++ #1419 смарт: Фролов 17.08.2023 //Контроль использования запчастей не для продажи</comment>
  <registerRecords>AccumulationRegister.смартКонтрольИспользованияЗапЧастейНеДляПродажи</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаГарантийныйРемонт</name>
      <type>
        <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТДКВозмещению</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТДПриход</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляЗамены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоступившее</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеДляЗамены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартКонтрольИспользованияЗапЧастейНеДляПродажи/смартКонтрольИспользованияЗапЧастейНеДляПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартКонтрольИспользованияЗапЧастейНеДляПродажи</name>
  <comment>//++ #1419 смарт: Фролов 16.08.2023 //Контроль использования запчастей не для продажи</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КВозмещению</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаГарантийныйРемонт</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТДКВозмещению</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТДПриход</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НеКомпенсировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ДокументПартии</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюСписанияПоРНПТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияОтгрузки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПартияПроизводства</name>
    <type>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Documents/смартКорректировкаГТДНеДляПродажи/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный=ПараметрыСеанса.ТекущийПользователь;
		Элементы.КорректировкаРегистров.Видимость=Ложь;
	Иначе	
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	КорректировкаРегистров.Ссылка КАК Ссылка
		                    |ИЗ
		                    |	Документ.КорректировкаРегистров КАК КорректировкаРегистров
		                    |ГДЕ
		                    |	КорректировкаРегистров.смартКорректировкаГТДНеДляПродажи = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка); 
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЭтаФорма.КорректировкаРегистров=Выборка.Ссылка; 
			Элементы.КорректировкаРегистров.Видимость=Истина; 
		Иначе
			Элементы.КорректировкаРегистров.Видимость=Ложь;
		КонецЕсли;
		ЗаполнитьОстаткамиНаСервере(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры


#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере(Перезаполнять=Истина)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура КАК Номенклатура,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДКВозмещению КАК НомерГТДКВозмещению,
	                    |	СУММА(смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.КоличествоОстаток) КАК КоличествоДляЗамены
	                    |ИЗ
	                    |	РегистрНакопления.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Остатки(
	                    |			,
	                    |			КВозмещению
	                    |				И НЕ НеКомпенсировать) КАК смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДКВозмещению
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ЗаявкаНаГарантийныйРемонт,
	                    |	Номенклатура");
	ЗапросПриходы=Новый Запрос("ВЫБРАТЬ
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура КАК Номенклатура,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДПриход КАК НомерГТДПриход,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Партия КАК Партия,
	                           |	СУММА(смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.КоличествоОстаток) КАК КоличествоПоступившее
	                           |ИЗ
	                           |	РегистрНакопления.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Остатки(, НЕ КВозмещению) КАК смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки
	                           |
	                           |СГРУППИРОВАТЬ ПО
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДПриход,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Партия"); 
	ЗапросОстаткиОрганизаций=Новый Запрос("ВЫБРАТЬ
	                                      |	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	                                      |	ТоварыОрганизацийОстатки.Организация КАК Организация,
	                                      |	ТоварыОрганизацийОстатки.ВидЗапасов КАК ВидЗапасов,
	                                      |	ТоварыОрганизацийОстатки.НомерГТД КАК НомерГТД,
	                                      |	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	                                      |	ТоварыОрганизацийОстатки.КоличествоОстаток КАК Количество
	                                      |ИЗ
	                                      |	РегистрНакопления.ТоварыОрганизаций.Остатки(, ) КАК ТоварыОрганизацийОстатки"); 
	
	Рез=Запрос.Выполнить().Выгрузить();	
	РезОстаткиОрганизаций=ЗапросОстаткиОрганизаций.Выполнить().Выгрузить();
	РезПриходы=ЗапросПриходы.Выполнить().Выгрузить(); 
	ТабПриходы.Загрузить(РезПриходы);
	Если Перезаполнять Тогда
		Объект.Состав.Очистить();
		Для Каждого Стр Из Рез Цикл
			СтрокиРезПриходы=РезПриходы.НайтиСтроки(Новый Структура("ЗаявкаНаГарантийныйРемонт,Номенклатура",Стр.ЗаявкаНаГарантийныйРемонт,Стр.Номенклатура)); 
			Если СтрокиРезПриходы.Количество()>0 Тогда
				Нашли=Ложь;
				Для Каждого СтрРезПриходы ИЗ СтрокиРезПриходы Цикл
					СтрокиРезОстаткиОрганизаций=РезОстаткиОрганизаций.НайтиСтроки(Новый Структура("НомерГТД,Номенклатура",СтрРезПриходы.НомерГТДПриход,Стр.Номенклатура));
					Если СтрокиРезОстаткиОрганизаций.Количество()>0 ТОгда
						Нашли=Истина;
						Прервать;
					КонецЕсли;                                        
				КонецЦикла;
				Если Нашли Тогда
					СтрСостав=Объект.Состав.Добавить();
					СтрСостав.ЗаявкаНаГарантийныйРемонт=Стр.ЗаявкаНаГарантийныйРемонт;
					СтрСостав.Номенклатура=Стр.Номенклатура;
					СтрСостав.НомерГТДКВозмещению=Стр.НомерГТДКВозмещению;  
					СтрСостав.КоличествоДляЗамены=Стр.КоличествоДляЗамены; 
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоставПриАктивизацииСтрокиНаСервере(СтруктураДляСтроки)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	                    |	ТоварыОрганизацийОстатки.Организация КАК Организация,
	                    |	ТоварыОрганизацийОстатки.ВидЗапасов КАК ВидЗапасов,
	                    |	ТоварыОрганизацийОстатки.КоличествоОстаток КАК Количество
	                    |ИЗ
	                    |	РегистрНакопления.ТоварыОрганизаций.Остатки(
	                    |			,
	                    |			АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
	                    |				И НомерГТД = &НомерГТД) КАК ТоварыОрганизацийОстатки");
	Запрос.УстановитьПараметр("Номенклатура",СтруктураДляСтроки.Номенклатура);  
	Запрос.УстановитьПараметр("НомерГТД",СтруктураДляСтроки.НомерГТД);  
	Рез=Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из Рез Цикл
		СтрТаблицаВыбора=ТаблицаВыбора.Добавить();		
		СтрТаблицаВыбора.АналитикаУчетаНоменклатуры=Стр.АналитикаУчетаНоменклатуры;
		СтрТаблицаВыбора.Организация=Стр.Организация;
		СтрТаблицаВыбора.ВидЗапасов=Стр.ВидЗапасов;
		СтрТаблицаВыбора.НомерГТД=СтруктураДляСтроки.НомерГТД;   
		СтрТаблицаВыбора.Партия=СтруктураДляСтроки.Партия;
		СтрТаблицаВыбора.ЗаявкаНаГарантийныйРемонт=СтруктураДляСтроки.ЗаявкаНаГарантийныйРемонт;
		СтрТаблицаВыбора.Номенклатура=СтруктураДляСтроки.Номенклатура;
		СтрТаблицаВыбора.КоличествоПоступившее=?(Стр.Количество>СтруктураДляСтроки.КоличествоПоступившее,СтруктураДляСтроки.КоличествоПоступившее,Стр.Количество);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СоставПриАктивизацииСтроки(Элемент)
	ТаблицаВыбора.Очистить();
	ТекДанные=Элемент.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	СтрокиТабПриходы=ТабПриходы.НайтиСтроки(Новый Структура("ЗаявкаНаГарантийныйРемонт,Номенклатура",ТекДанные.ЗаявкаНаГарантийныйРемонт,ТекДанные.Номенклатура));
	Для Каждого СтрТабПриходы ИЗ СтрокиТабПриходы Цикл
		//Если ЗначениеЗаполнено(СтрТабПриходы.НомерГТДПриход) Тогда
			СтруктураДляСтроки=Новый Структура("ЗаявкаНаГарантийныйРемонт,Номенклатура,НомерГТД,Партия,КоличествоПоступившее",СтрТабПриходы.ЗаявкаНаГарантийныйРемонт,СтрТабПриходы.Номенклатура,СтрТабПриходы.НомерГТДПриход,СтрТабПриходы.Партия,СтрТабПриходы.КоличествоПоступившее);
			СоставПриАктивизацииСтрокиНаСервере(СтруктураДляСтроки);            
		//КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиКВозмещениюНаСервере()
	Объект.Состав.Очистить();
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура КАК Номенклатура,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДКВозмещению КАК НомерГТДКВозмещению,
	                    |	СУММА(смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.КоличествоОстаток) КАК КоличествоДляЗамены
	                    |ИЗ
	                    |	РегистрНакопления.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Остатки(
	                    |			,
	                    |			КВозмещению
	                    |				И НЕ НеКомпенсировать) КАК смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДКВозмещению
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ЗаявкаНаГарантийныйРемонт,
	                    |	Номенклатура");
	ЗапросПриходы=Новый Запрос("ВЫБРАТЬ
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура КАК Номенклатура,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДПриход КАК НомерГТДПриход,
	                           |	СУММА(смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.КоличествоОстаток) КАК КоличествоПоступившее,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Партия КАК Партия
	                           |ИЗ
	                           |	РегистрНакопления.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Остатки(, НЕ КВозмещению) КАК смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки
	                           |
	                           |СГРУППИРОВАТЬ ПО
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДПриход,
	                           |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Партия");
	Рез=Запрос.Выполнить().Выгрузить();
	РезПриходы=ЗапросПриходы.Выполнить().Выгрузить(); 
	ТабПриходы.Загрузить(РезПриходы);
	Для Каждого Стр Из Рез Цикл
		СтрокиРезПриходы=РезПриходы.НайтиСтроки(Новый Структура("ЗаявкаНаГарантийныйРемонт,Номенклатура",Стр.ЗаявкаНаГарантийныйРемонт,Стр.Номенклатура));
		Если СтрокиРезПриходы.Количество()>0 ТОгда
			СтрСостав=Объект.Состав.Добавить();
			СтрСостав.ЗаявкаНаГарантийныйРемонт=Стр.ЗаявкаНаГарантийныйРемонт;
			СтрСостав.Номенклатура=Стр.Номенклатура;
			СтрСостав.НомерГТДКВозмещению=Стр.НомерГТДКВозмещению;  
			СтрСостав.КоличествоДляЗамены=Стр.КоличествоДляЗамены;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиКВозмещению(Команда)
	ЗаполнитьОстаткамиКВозмещениюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанныеИсх=Элемент.ТекущиеДанные;
	ТекДанныеКон=Элементы.Состав.ТекущиеДанные;
	ТекДанныеКон.ВидЗапасов=ТекДанныеИсх.ВидЗапасов;
	ТекДанныеКон.АналитикаУчетаНоменклатуры=ТекДанныеИсх.АналитикаУчетаНоменклатуры;
	ТекДанныеКон.НомерГТДПриход=ТекДанныеИсх.НомерГТД;
	ТекДанныеКон.Партия=ТекДанныеИсх.Партия; 
	ТекДанныеКон.Организация=ТекДанныеИсх.Организация;
	ТекДанныеКон.КоличествоПоступившее=?(ТекДанныеКон.КоличествоДляЗамены<ТекДанныеИсх.КоличествоПоступившее,ТекДанныеКон.КоличествоДляЗамены,ТекДанныеИсх.КоличествоПоступившее);
	//ТекДанныеКон.КоличествоДляЗамены=?(ТекДанныеКон.КоличествоДляЗамены>ТекДанныеИсх.КоличествоПоступившее,ТекДанныеИсх.КоличествоПоступившее,ТекДанныеКон.КоличествоДляЗамены);
	ТекДанныеКон.Пометка=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаРегистровНажатие(Элемент, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		Если ТипЗнч(ЭтаФорма.КорректировкаРегистров)=Тип("ДокументСсылка.КорректировкаРегистров") Тогда
			СтандартнаяОбработка=Ложь;
			ПоказатьЗначение(,ЭтаФорма.КорректировкаРегистров);
		КонецЕсли; 
	Иначе	
		Сообщить("Необходимо записать документ!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Запрос=Новый Запрос("ВЫБРАТЬ
		|	КорректировкаРегистров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|ГДЕ
		|	КорректировкаРегистров.смартКорректировкаГТДНеДляПродажи = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ТекущийОбъект.Ссылка); 
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтаФорма.КорректировкаРегистров=Выборка.Ссылка; 
		Элементы.КорректировкаРегистров.Видимость=Истина; 
	Иначе
		Элементы.КорректировкаРегистров.Видимость=Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДляПервоначальнойЧисткиНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт.Организация КАК Организация,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура КАК Номенклатура,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДКВозмещению КАК НомерГТДКВозмещению,
	                    |	СУММА(смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.КоличествоОстаток) КАК Количество
	                    |ПОМЕСТИТЬ КВозмещению
	                    |ИЗ
	                    |	РегистрНакопления.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Остатки(, КВозмещению) КАК смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДКВозмещению,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт.Организация
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Партия.Организация КАК Организация,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт.Организация КАК ОрганизацияКВозмещению,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура КАК Номенклатура,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Партия КАК Партия,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДПриход КАК НомерГТДПриход,
	                    |	СУММА(смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.КоличествоОстаток) КАК Количество
	                    |ПОМЕСТИТЬ Приходы
	                    |ИЗ
	                    |	РегистрНакопления.смартКонтрольИспользованияЗапЧастейНеДляПродажи.Остатки(, НЕ КВозмещению) КАК смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Номенклатура,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.НомерГТДПриход,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Партия,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.Партия.Организация,
	                    |	смартКонтрольИспользованияЗапЧастейНеДляПродажиОстатки.ЗаявкаНаГарантийныйРемонт.Организация
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	СебестоимостьТоваровОстатки.Организация КАК Организация,
	                    |	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	                    |	СебестоимостьТоваровОстатки.Партия КАК Партия,
	                    |	СУММА(СебестоимостьТоваровОстатки.КоличествоОстаток) КАК КоличествоОстаток
	                    |ПОМЕСТИТЬ Себестоимость
	                    |ИЗ
	                    |	РегистрНакопления.СебестоимостьТоваров.Остатки КАК СебестоимостьТоваровОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	СебестоимостьТоваровОстатки.Организация,
	                    |	СебестоимостьТоваровОстатки.Партия,
	                    |	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ИСТИНА КАК Пометка,
	                    |	Приходы.ЗаявкаНаГарантийныйРемонт.Номер КАК Номер,
	                    |	Приходы.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	                    |	Приходы.ОрганизацияКВозмещению КАК ОрганизацияКВозмещению,
	                    |	Приходы.Организация КАК Организация,
	                    |	Приходы.Номенклатура КАК Номенклатура,
	                    |	КВозмещению.НомерГТДКВозмещению КАК НомерГТДКВозмещению,
	                    |	Приходы.НомерГТДПриход КАК НомерГТДПриход,
	                    |	Приходы.Партия КАК Партия,
	                    |	СУММА(ЕСТЬNULL(КВозмещению.Количество, 0)) КАК КоличествоДляЗамены,
	                    |	СУММА(Приходы.Количество) КАК КоличествоПоступившее,
	                    |	СУММА(ЕСТЬNULL(Себестоимость.КоличествоОстаток, 0)) КАК ОстаткиСебестоимость
	                    |ИЗ
	                    |	Приходы КАК Приходы
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Себестоимость КАК Себестоимость
	                    |		ПО Приходы.Организация = Себестоимость.Организация
	                    |			И Приходы.Номенклатура = Себестоимость.Номенклатура
	                    |			И Приходы.Партия = Себестоимость.Партия
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КВозмещению КАК КВозмещению
	                    |		ПО Приходы.ЗаявкаНаГарантийныйРемонт = КВозмещению.ЗаявкаНаГарантийныйРемонт
	                    |			И Приходы.Номенклатура = КВозмещению.Номенклатура
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	Приходы.Номенклатура,
	                    |	Приходы.НомерГТДПриход,
	                    |	Приходы.ЗаявкаНаГарантийныйРемонт,
	                    |	Приходы.Организация,
	                    |	Приходы.Партия,
	                    |	КВозмещению.НомерГТДКВозмещению,
	                    |	Приходы.ЗаявкаНаГарантийныйРемонт.Номер,
	                    |	Приходы.ОрганизацияКВозмещению
	                    |
	                    |ИМЕЮЩИЕ
	                    |	СУММА(ЕСТЬNULL(Себестоимость.КоличествоОстаток, 0)) = 0
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Номер,
	                    |	Номенклатура,
	                    |	Партия"); 
	Объект.Состав.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДляПервоначальнойЧистки(Команда)
	ЗагрузитьДляПервоначальнойЧисткиНаСервере();
КонецПроцедуры

#КонецОбласти
